print ("Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. .")

a = input ("Введите недостающее первое слово:")
b = input ("Введите недостающее второе слово:")
c = input ("Введите недостающее третье слово:")
d = input ("Введите недостающее четверое слово:")
e = input ("Введите недостающее пятое слово:")
f = input ("Введите недостающее шестое слово:")
g = input ("Введите недостающее седьмое слово:")

print (f"Шляпка гриба, покрытая {a} кожиц{b}й, держится на {c} ножк{d} . Снизу шляпка затянута {e} плёнкой. Когда её уберёшь, откроется нижняя {f} сторона шляпк{g} .")